###############################################################
#  Generated by:      Cadence Innovus 16.21-s078_1
#  OS:                Linux x86_64(Host ID cad1)
#  Generated on:      Fri Jun 15 11:47:14 2018
#  Design:            mips
#  Command:           saveDesign final.enc
###############################################################
current_design mips
create_clock [get_ports {clk}]  -name clk -period 5.000000 -waveform {0.000000 2.500000}
set_propagated_clock  [get_ports {clk}]
