# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name default -timing {../../../../../../staff2/matutani/lib/slow.lib}
create_constraint_mode -name default -sdc_files {mips.sdc}
create_delay_corner -name default -library_set {default}
create_analysis_view -name default -constraint_mode {default} -delay_corner {default}
set_analysis_view -setup {default} -hold {default}
